---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.WindowTypeName
source: html/1b64102a-91e8-e9cd-d027-60cfbe614b04.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.WindowTypeName Property

The name of the window type.

## Syntax (C#)
```csharp
public string WindowTypeName { get; }
```